Repository: Mahfoud-Sa/news_application
Catalog: lib/app/config/l10n/app_*.arb
Languages: ar

source: News Application
ar: تطبيق الاخبار

source: Last News
ar: اخر الاخبار

# setting
source: Settings
ar: الاعدادات

source: Language
ar: اللغة

source: Author
ar: الناشر

source: Click for more Detailes
ar: اضغك هنا للمزيد من التفاصيل

# nothingToShow
source: Nothing to showing
ar: لا يوجد اي شي ليتم عرضه

source: Favorite
ar: المفضلة

source: fetching data failed
ar: فشل في جلب البيانات

source: No Internet Connection
ar: لا يوجد اتصال بالانترنت

source: Search News
ar: ابحث بالاخبار

# this_has_been_added_to_favorite
source: ths has been added to the favorite
ar: تمت اضافتها للمفضلة

# this_is_allredy_exisit
source: This is Allready Exisit
ar: هذه المقالة مضافة مسبقا

source: Article Has Been Deleted Susseflly
ar: تم حذف المقالة بنجاح
